Revit 2015 API
Element.Parameter Property
Retrieves a parameter from the element given an identifier.
Overload List
Name | Description
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
Parameter[String]
Retrieves a parameter from the element given its name.
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
See Also
Element Class
Element Members
Autodesk.Revit.DB Namespace